"""Напишите программу, которая выведет текст: Привет, Яндекс!."""
print('Привет, Яндекс')