"""
Каждому нужен отдых! Предлагаем сделать паузу от решения задач... И сделать что-то действительно интересное.

Напишите программу, которая N раз выводит строку «Купи слона!».

Формат ввода
Одно натуральное число 
N
N

Формат вывода
N
N строк с фразой: "Купи слона!"
"""
times = int(input())
print('Купи слона!\n' * times, end='')